namesA = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'あ', 'い', 'う', ' え', 'か', 'き', 'く', 'け', 'こ', 'さ', 'す', 'せ',
           'そ', 'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'ほ', 'ま', 'み', 'む', 'め', 'も', 'や', 
           'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 
            'Y', 'B', 'E', 'H', 'K', 'M',
            "札幌", "函館", "旭川", "室蘭", "苫小牧", "釧路", "知床", "帯広", "北見", "小樽", "千歳",
            "青森", "弘前", "八戸", "岩手", "盛岡", "平泉", "宮城", "仙台", "秋田", "山形", "庄内", "福島", 
            "会津", "郡山", "白河", "いわき", "水戸", "日立", "土浦", "つくば", "栃木", "那須", "とちぎ", "宇都宮", 
            "足利", "群馬", "前橋", "高崎", "伊勢崎", "桐生", "埼玉", "川口", "所沢", "川越", "熊谷", "春日部", 
            "越谷", "千葉", "成田", "習志野", "市川", "船橋", "袖ヶ浦", "市原", "野田", "柏", "松戸", "品川", 
            "世田谷", "練馬", "杉並", "板橋", "足立", "江東", "葛飾", "八王子", "多摩", "神奈川", "横浜", 
            "川崎", "湘南", "相模", "相模原", "山梨", "富士山", "新潟", "長岡", "上越", "長野", "松本", "諏訪", 
            "富山", "石川", "金沢", "福井", "岐阜", "飛騨", "静岡", "浜松", "沼津", "伊豆", "富士", "御殿場", 
            "愛知", "豊橋", "三河", "岡崎", "豊田", "尾張小牧", "一宮", "春日井", "名古屋", "三重", "鈴鹿", 
            "四日市", "伊勢志摩", "滋賀", "京都", "大阪", "和泉","堺", "吹田", "高槻", "奈良", "飛鳥", 
            "和歌山", "兵庫", "姫路", "鳥取", "島根", "出雲", "岡山", "倉敷", "津山", "広島", "福山", 
            "呉", "三次", "山口", "下関", "徳島", "香川", "高松", "丸亀", "愛媛", "高知", "福岡", "北九州", 
            "久留米", "筑豊", "博多", "宗像", "佐賀", "長崎", "佐世保", "長崎市", "熊本", "大分", "宮崎", 
            "鹿児島", "奄美", "沖縄", "なにわ","神戸","大宮"
        ]

namesB = ["plate"]